## Import data

In [1]:
import pandas as pd
import numpy as np
import pickle
import tensorflow as tf
import tensorflow.keras as kr

from sklearn.model_selection import KFold
from sklearn.model_selection import cross_val_score
from sklearn.model_selection import train_test_split
from sklearn.model_selection import GridSearchCV
from sklearn.metrics import accuracy_score

In [2]:
gradient_model = pickle.load(open("../output/gradient.pkl", 'rb'))
forest_model = pickle.load(open("../output/forest.pkl", 'rb'))
votation_model = pickle.load(open("../output/votation.pkl", 'rb'))

In [8]:
test = pd.read_csv("../input/test.csv")
x_test = pd.read_csv("../input/mapped_test.csv")

## Predict the survival probability

In [6]:
gradient_prediction = gradient_model.predict(x_test)
forest_prediction = forest_model.predict(x_test)
votation_prediction = votation_model.predict(x_test)

## Create the prediction dataset

In [9]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [20]:
dataset = pd.DataFrame()
dataset["PassengerID"] = test["PassengerId"]
dataset.head()

   PassengerID
0          892
1          893
2          894
3          895
4          896

In [21]:
gradient_submission = dataset 
forest_submission = dataset
votation_submission = dataset

gradient_submission["Survived"] = gradient_prediction
forest_submission["Survived"] = forest_prediction
votation_submission["Survived"] = votation_prediction

## Make sure all data is correct

In [22]:
gradient_submission.head()

   PassengerID  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

In [23]:
forest_submission.head()

   PassengerID  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

In [24]:
votation_submission.head()

   PassengerID  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         1

## Export data

In [25]:
gradient_submission.to_csv("../output/gradient_submission.csv", index=False)

In [26]:
forest_submission.to_csv("../output/forest_submission.csv", index=False)

In [27]:
votation_submission.to_csv("../output/votation_submission.csv", index=False)